In [2]:
import numpy as np
import pandas as pd

In [3]:
std = pd.read_csv('D:/ai/numpy,pandase,motplotlib/pandas/student.csv', sep=' ')
std

    first_name last_name   age  gender
0          Ali    Ahamdi  21.0    male
1   Assadullah    rahimi  22.0    male
2       Golsom    rahimi  19.0  female
3        zahra    Taheri  20.0  female
4        Ahamd    Rasoli   NaN    male
5  Rahmatullah  Jamshadi  20.0    male
6   Assadullah    rahimi  22.0    male

In [10]:
std.gender

0      male
1      male
2    female
3    female
Name: gender, dtype: object

In [14]:
std.loc[0,['first_name','last_name']]

first_name       Ali
last_name     Ahamdi
Name: 0, dtype: object

In [19]:
std.iloc[3,[0,3]]

first_name     zahra
gender        female
Name: 3, dtype: object

In [20]:
std.iloc[:,[0,3]]

   first_name  gender
0         Ali    male
1  Assadullah    male
2      Golsom  female
3       zahra  female

In [21]:
std.iloc[:,:]

   first_name last_name  age  gender
0         Ali    Ahamdi   21    male
1  Assadullah    rahimi   22    male
2      Golsom    rahimi   19  female
3       zahra    Taheri   20  female

In [24]:
std.iloc[:2,:3:2]

   first_name  age
0         Ali   21
1  Assadullah   22

In [25]:
std.isna()

   first_name  last_name    age  gender
0       False      False  False   False
1       False      False  False   False
2       False      False  False   False
3       False      False  False   False

In [26]:
std = pd.read_csv('D:/ai/numpy,pandase,motplotlib/pandas/student.csv', sep=' ')
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [27]:
std.isna()

   first_name  last_name    age  gender
0       False      False  False   False
1       False      False  False   False
2       False      False  False   False
3       False      False  False   False
4       False      False   True   False

In [28]:
std.isna().any()

first_name    False
last_name     False
age            True
gender        False
dtype: bool

In [29]:
std.isna().all()

first_name    False
last_name     False
age           False
gender        False
dtype: bool

In [34]:
std = pd.read_csv('D:/ai/numpy,pandase,motplotlib/pandas/student.csv', sep=' ')
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [35]:
std2 = std.dropna()
std2

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female

In [36]:
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [38]:
std2 = std.dropna(axis=0)
std2

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female

In [39]:
std.shape

(5, 4)

In [40]:
print(std.shape)

(5, 4)

In [42]:
print(std.shape,std2.shape)

(5, 4) (4, 4)

In [52]:
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female

In [54]:
std = pd.read_csv('D:/ai/numpy,pandase,motplotlib/pandas/student.csv', sep=' ')
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [56]:
std.fillna(20)

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli  20.0    male

In [61]:
std.gender=='male'

0     True
1     True
2    False
3    False
4     True
Name: gender, dtype: bool

In [62]:
std[std.gender=='male']

   first_name last_name   age gender
0         Ali    Ahamdi  21.0   male
1  Assadullah    rahimi  22.0   male
4       Ahamd    Rasoli   NaN   male

In [63]:
std[(std.gender=='male')&(std.age>20)]

   first_name last_name   age gender
0         Ali    Ahamdi  21.0   male
1  Assadullah    rahimi  22.0   male

In [65]:
std.fillna(std.mean(numeric_only=True))

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli  20.5    male

In [67]:
std.max(numeric_only=True)

age    22.0
dtype: float64

In [68]:
std

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [71]:
std1 = std.fillna(std.mode())

In [72]:
std1

   first_name last_name   age  gender
0         Ali    Ahamdi  21.0    male
1  Assadullah    rahimi  22.0    male
2      Golsom    rahimi  19.0  female
3       zahra    Taheri  20.0  female
4       Ahamd    Rasoli   NaN    male

In [3]:
std = pd.read_csv('D:/ai/numpy,pandase,motplotlib/pandas/student.csv', sep=' ')
std

FileNotFoundError: [Errno 2] No such file or directory: 'D:/ai/numpy,pandase,motplotlib/pandas/student.csv'

In [81]:
std1 = std.fillna(std.mode().iloc[0])
# mode().iloc[0] because there is more then one mode, each colums has its own mode

In [82]:
std1

    first_name last_name   age  gender
0          Ali    Ahamdi  21.0    male
1   Assadullah    rahimi  22.0    male
2       Golsom    rahimi  19.0  female
3        zahra    Taheri  20.0  female
4        Ahamd    Rasoli  20.0    male
5  Rahmatullah  Jamshadi  20.0    male

In [84]:
std.mode().iloc[0]

first_name     Ahamd
last_name     rahimi
age             20.0
gender          male
Name: 0, dtype: object

In [12]:
std.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [14]:
std.duplicated().any()

True

In [73]:
dp_std = pd.concat((std,std.iloc[:2]),ignore_index=True)
dp_std

    first_name last_name   age  gender
0          Ali    Ahamdi  21.0    male
1   Assadullah    rahimi  22.0    male
2       Golsom    rahimi  19.0  female
3        zahra    Taheri  20.0  female
4        Ahamd    Rasoli   NaN    male
5  Rahmatullah  Jamshadi  20.0    male
6   Assadullah    rahimi  22.0    male
7          Ali    Ahamdi  21.0    male
8   Assadullah    rahimi  22.0    male

In [74]:
dp_std.rename({'first_name':'firstName','last_name':'lastName','age':'Age'}, inplace=True, axis=1)

In [75]:
dp_std

     firstName  lastName   Age  gender
0          Ali    Ahamdi  21.0    male
1   Assadullah    rahimi  22.0    male
2       Golsom    rahimi  19.0  female
3        zahra    Taheri  20.0  female
4        Ahamd    Rasoli   NaN    male
5  Rahmatullah  Jamshadi  20.0    male
6   Assadullah    rahimi  22.0    male
7          Ali    Ahamdi  21.0    male
8   Assadullah    rahimi  22.0    male

In [76]:
import random

In [77]:
dp_std['salary'] = random.random()*100

In [78]:
dp_std['salary1'] = dp_std.salary.round()

In [79]:
dp_std

     firstName  lastName   Age  gender     salary  salary1
0          Ali    Ahamdi  21.0    male  84.271894     84.0
1   Assadullah    rahimi  22.0    male  84.271894     84.0
2       Golsom    rahimi  19.0  female  84.271894     84.0
3        zahra    Taheri  20.0  female  84.271894     84.0
4        Ahamd    Rasoli   NaN    male  84.271894     84.0
5  Rahmatullah  Jamshadi  20.0    male  84.271894     84.0
6   Assadullah    rahimi  22.0    male  84.271894     84.0
7          Ali    Ahamdi  21.0    male  84.271894     84.0
8   Assadullah    rahimi  22.0    male  84.271894     84.0

In [81]:
pd.Series(np.random.randint(0,10,8))

0    6
1    6
2    8
3    5
4    3
5    4
6    8
7    7
dtype: int32

In [85]:
dp_std['randin'] = pd.Series(np.random.randint(0,10,9))
dp_std

     firstName  lastName   Age  gender     salary  salary1  randin
0          Ali    Ahamdi  21.0    male  84.271894     84.0       2
1   Assadullah    rahimi  22.0    male  84.271894     84.0       1
2       Golsom    rahimi  19.0  female  84.271894     84.0       4
3        zahra    Taheri  20.0  female  84.271894     84.0       9
4        Ahamd    Rasoli   NaN    male  84.271894     84.0       7
5  Rahmatullah  Jamshadi  20.0    male  84.271894     84.0       9
6   Assadullah    rahimi  22.0    male  84.271894     84.0       0
7          Ali    Ahamdi  21.0    male  84.271894     84.0       4
8   Assadullah    rahimi  22.0    male  84.271894     84.0       5

In [87]:
dstd = dp_std.iloc[:4]
dstd

    firstName lastName   Age  gender     salary  salary1  randin
0         Ali   Ahamdi  21.0    male  84.271894     84.0       2
1  Assadullah   rahimi  22.0    male  84.271894     84.0       1
2      Golsom   rahimi  19.0  female  84.271894     84.0       4
3       zahra   Taheri  20.0  female  84.271894     84.0       9

In [88]:
dstd1 = pd.concat((dp_std,dstd),axis = 0,ignore_index=True)

In [89]:
dstd1

      firstName  lastName   Age  gender     salary  salary1  randin
0           Ali    Ahamdi  21.0    male  84.271894     84.0       2
1    Assadullah    rahimi  22.0    male  84.271894     84.0       1
2        Golsom    rahimi  19.0  female  84.271894     84.0       4
3         zahra    Taheri  20.0  female  84.271894     84.0       9
4         Ahamd    Rasoli   NaN    male  84.271894     84.0       7
5   Rahmatullah  Jamshadi  20.0    male  84.271894     84.0       9
6    Assadullah    rahimi  22.0    male  84.271894     84.0       0
7           Ali    Ahamdi  21.0    male  84.271894     84.0       4
8    Assadullah    rahimi  22.0    male  84.271894     84.0       5
9           Ali    Ahamdi  21.0    male  84.271894     84.0       2
10   Assadullah    rahimi  22.0    male  84.271894     84.0       1
11       Golsom    rahimi  19.0  female  84.271894     84.0       4
12        zahra    Taheri  20.0  female  84.271894     84.0       9

In [90]:
dstd1.drop(['firstName'],axis=1)

    lastName   Age  gender     salary  salary1  randin
0     Ahamdi  21.0    male  84.271894     84.0       2
1     rahimi  22.0    male  84.271894     84.0       1
2     rahimi  19.0  female  84.271894     84.0       4
3     Taheri  20.0  female  84.271894     84.0       9
4     Rasoli   NaN    male  84.271894     84.0       7
5   Jamshadi  20.0    male  84.271894     84.0       9
6     rahimi  22.0    male  84.271894     84.0       0
7     Ahamdi  21.0    male  84.271894     84.0       4
8     rahimi  22.0    male  84.271894     84.0       5
9     Ahamdi  21.0    male  84.271894     84.0       2
10    rahimi  22.0    male  84.271894     84.0       1
11    rahimi  19.0  female  84.271894     84.0       4
12    Taheri  20.0  female  84.271894     84.0       9

In [92]:
dstd1.drop(range(5),axis=0)

      firstName  lastName   Age  gender     salary  salary1  randin
5   Rahmatullah  Jamshadi  20.0    male  84.271894     84.0       9
6    Assadullah    rahimi  22.0    male  84.271894     84.0       0
7           Ali    Ahamdi  21.0    male  84.271894     84.0       4
8    Assadullah    rahimi  22.0    male  84.271894     84.0       5
9           Ali    Ahamdi  21.0    male  84.271894     84.0       2
10   Assadullah    rahimi  22.0    male  84.271894     84.0       1
11       Golsom    rahimi  19.0  female  84.271894     84.0       4
12        zahra    Taheri  20.0  female  84.271894     84.0       9

In [94]:
dstd1.Age

0     21.0
1     22.0
2     19.0
3     20.0
4      NaN
5     20.0
6     22.0
7     21.0
8     22.0
9     21.0
10    22.0
11    19.0
12    20.0
Name: Age, dtype: float64

In [96]:
dstd1.fillna(dstd1.mode().iloc[:])

      firstName  lastName   Age  gender     salary  salary1  randin
0           Ali    Ahamdi  21.0    male  84.271894     84.0       2
1    Assadullah    rahimi  22.0    male  84.271894     84.0       1
2        Golsom    rahimi  19.0  female  84.271894     84.0       4
3         zahra    Taheri  20.0  female  84.271894     84.0       9
4         Ahamd    Rasoli   NaN    male  84.271894     84.0       7
5   Rahmatullah  Jamshadi  20.0    male  84.271894     84.0       9
6    Assadullah    rahimi  22.0    male  84.271894     84.0       0
7           Ali    Ahamdi  21.0    male  84.271894     84.0       4
8    Assadullah    rahimi  22.0    male  84.271894     84.0       5
9           Ali    Ahamdi  21.0    male  84.271894     84.0       2
10   Assadullah    rahimi  22.0    male  84.271894     84.0       1
11       Golsom    rahimi  19.0  female  84.271894     84.0       4
12        zahra    Taheri  20.0  female  84.271894     84.0       9

In [101]:
dstd1.fillna(dstd1.mean(numeric_only=True),inplace=True)

In [102]:
dstd1.isna().any()

firstName    False
lastName     False
Age          False
gender       False
salary       False
salary1      False
randin       False
dtype: bool

In [106]:
dstd1.Age.value_counts()

Age
22.00    4
21.00    3
20.00    3
19.00    2
20.75    1
Name: count, dtype: int64

In [107]:
dstd1.isna().sum()

firstName    0
lastName     0
Age          0
gender       0
salary       0
salary1      0
randin       0
dtype: int64

In [108]:
dstd1.memory_usage()

Index        132
firstName    104
lastName     104
Age          104
gender       104
salary       104
salary1      104
randin        52
dtype: int64

In [116]:
dstd1['gender1']=pd.Categorical(dstd1.gender)

In [117]:
dstd1

      firstName  lastName    Age  gender     salary  salary1  randin gender1
0           Ali    Ahamdi  21.00    male  84.271894     84.0       2    male
1    Assadullah    rahimi  22.00    male  84.271894     84.0       1    male
2        Golsom    rahimi  19.00  female  84.271894     84.0       4  female
3         zahra    Taheri  20.00  female  84.271894     84.0       9  female
4         Ahamd    Rasoli  20.75    male  84.271894     84.0       7    male
5   Rahmatullah  Jamshadi  20.00    male  84.271894     84.0       9    male
6    Assadullah    rahimi  22.00    male  84.271894     84.0       0    male
7           Ali    Ahamdi  21.00    male  84.271894     84.0       4    male
8    Assadullah    rahimi  22.00    male  84.271894     84.0       5    male
9           Ali    Ahamdi  21.00    male  84.271894     84.0       2    male
10   Assadullah    rahimi  22.00    male  84.271894     84.0       1    male
11       Golsom    rahimi  19.00  female  84.271894     84.0       4  female
12        zahra    Taheri  20.00  female  84.271894     84.0       9  female

In [118]:
dstd1.memory_usage()

Index        132
firstName    104
lastName     104
Age          104
gender       137
salary       104
salary1      104
randin        52
gender1      137
dtype: int64

In [121]:
dstd1.drop(['gender1'],axis=1,inplace=True)

In [122]:
dstd1

      firstName  lastName    Age  gender     salary  salary1  randin
0           Ali    Ahamdi  21.00    male  84.271894     84.0       2
1    Assadullah    rahimi  22.00    male  84.271894     84.0       1
2        Golsom    rahimi  19.00  female  84.271894     84.0       4
3         zahra    Taheri  20.00  female  84.271894     84.0       9
4         Ahamd    Rasoli  20.75    male  84.271894     84.0       7
5   Rahmatullah  Jamshadi  20.00    male  84.271894     84.0       9
6    Assadullah    rahimi  22.00    male  84.271894     84.0       0
7           Ali    Ahamdi  21.00    male  84.271894     84.0       4
8    Assadullah    rahimi  22.00    male  84.271894     84.0       5
9           Ali    Ahamdi  21.00    male  84.271894     84.0       2
10   Assadullah    rahimi  22.00    male  84.271894     84.0       1
11       Golsom    rahimi  19.00  female  84.271894     84.0       4
12        zahra    Taheri  20.00  female  84.271894     84.0       9

In [123]:
dstd1.memory_usage()

Index        132
firstName    104
lastName     104
Age          104
gender       137
salary       104
salary1      104
randin        52
dtype: int64

In [127]:
random.choices(['dkj','dkdk','dkdk'],k=5)

['dkdk', 'dkdk', 'dkdk', 'dkdk', 'dkj']

In [129]:
dstd1['score']=pd.Series(random.choices(['very low','low','medium','heigh','very heigh'],k=13))

In [130]:
dstd1

,firstName,lastName,Age,gender,salary,salary1,randin,score
0,Ali,Ahamdi,21.00,male,84.271894,84.0,2,very low
1,Assadullah,rahimi,22.00,male,84.271894,84.0,1,very heigh
2,Golsom,rahimi,19.00,female,84.271894,84.0,4,very low
3,zahra,Taheri,20.00,female,84.271894,84.0,9,medium
4,Ahamd,Rasoli,20.75,male,84.271894,84.0,7,very low
5,Rahmatullah,Jamshadi,20.00,male,84.271894,84.0,9,low
6,Assadullah,rahimi,22.00,male,84.271894,84.0,0,very low
7,Ali,Ahamdi,21.00,male,84.271894,84.0,4,very low
8,Assadullah,rahimi,22.00,male,84.271894,84.0,5,very heigh
9,Ali,Ahamdi,21.00,male,84.271894,84.0,2,medium
10,Assadullah,rahimi,22.00,male,84.271894,84.0,1,low
11,Golsom,rahimi,19.00,female,84.271894,84.0,4,very low
12,zahra,Taheri,20.00,female,84.271894,84.0,9,low

In [132]:
dstd1.dtypes

firstName      object
lastName       object
Age           float64
gender       category
salary        float64
salary1       float64
randin          int32
score          object
dtype: object

In [136]:
dstd1['score']=pd.Categorical(dstd1.score,categories=['very low','low','medium','heigh','very heigh'],ordered=True)

In [138]:
sum(dstd1.score>'medium')

2

In [147]:
dstd1['catSalary']=pd.cut(dstd1.salary,bins=[70,75,80,90,100,150],labels=['very low','low','medium','heigh','very heigh'])

In [148]:
dstd1

,firstName,lastName,Age,gender,salary,salary1,randin,score,catSalary
0,Ali,Ahamdi,21.00,male,84.271894,84.0,2,very low,medium
1,Assadullah,rahimi,22.00,male,84.271894,84.0,1,very heigh,medium
2,Golsom,rahimi,19.00,female,84.271894,84.0,4,very low,medium
3,zahra,Taheri,20.00,female,84.271894,84.0,9,medium,medium
4,Ahamd,Rasoli,20.75,male,84.271894,84.0,7,very low,medium
5,Rahmatullah,Jamshadi,20.00,male,84.271894,84.0,9,low,medium
6,Assadullah,rahimi,22.00,male,84.271894,84.0,0,very low,medium
7,Ali,Ahamdi,21.00,male,84.271894,84.0,4,very low,medium
8,Assadullah,rahimi,22.00,male,84.271894,84.0,5,very heigh,medium
9,Ali,Ahamdi,21.00,male,84.271894,84.0,2,medium,medium
10,Assadullah,rahimi,22.00,male,84.271894,84.0,1,low,medium
11,Golsom,rahimi,19.00,female,84.271894,84.0,4,very low,medium
12,zahra,Taheri,20.00,female,84.271894,84.0,9,low,medium

In [149]:
dstd1.memory_usage()

Index        132
firstName    104
lastName     104
Age          104
gender       137
salary       104
salary1      104
randin        52
score        225
catSalary    225
dtype: int64